[
    {
        "title": "Deja Vu Lottery Numbers",
        "user_id": 3,
        "subreddit_id": 4,
        "body": "Dreamt of winning the lottery with a set of numbers I'd never seen before. Checked the winning numbers the next day: they matched. Is my subconscious a time traveler, or did I just get lucky in two timelines?"
    },
    {
        "title": "Faded Photo. Fresh Memories",
        "user_id": 4,
        "subreddit_id": 4,
        "body": "Found an old family photo, but I distinctly remember an extra person in the picture who wasn't there before. Alternate timeline family reunion, or did Photoshop sneak into the '90s?"
    },
    {
        "title": "I Think I Time Traveled to 1985 Last Night",
        "body": "Last night, I dreamt I was in 1985 at an arcade playing Pac-Man. Everything felt so real, and when I woke up, I had a strange sense of nostalgia. Could it have been time travel, or just a vivid dream?",
        "subreddit_id": 4,
        "user_id": 2
    },
    {
        "title": "The Strangest Dream I've Ever Had: Time Travel to the 60s",
        "body": "I had this dream where I woke up in the 60s. Everything was different, but I knew exactly where I was. It felt like I had time-traveled, even though I was still in my bed. Has anyone else had time travel dreams?",
        "subreddit_id": 4,
        "user_id": 2
    },
    {
        "title": "I Swear I Went Back in Time During a Power Outage Last Night",
        "body": "Last night, during a sudden power outage, I found myself feeling like I had traveled back in time. The quiet and lack of modern distractions made me feel like I was in the 90s again. Anyone else experienced something like this?",
        "subreddit_id": 4,
        "user_id": 3
    },
    {
        "title": "Time Travel via Dreams: My Weird Experience",
        "body": "I had the strangest dream where I was in the 1920s, experiencing the world as it was back then. It felt so real that when I woke up, I was disoriented. Has anyone else had time travel-like dreams?",
        "subreddit_id": 4,
        "user_id": 2
    }
]